Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཇི་ལྟར་སྤྱོད་ན་ཐབས་མཁས་པར་ཤེས་པར་བྱ། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། གཟུགས་ལ་མི་སྤྱོད། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཡང་མི་སྤྱོད། གཟུགས་ཀྱི་མཚན་མ་ལ་མི་སྤྱོད།
en: Venerable Subhūti, how may one know, when bodhisattva great beings are practicing the perfection of wisdom, that they do possess skill in means?” “

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མཚན་མ་ལ་མི་སྤྱོད། གཟུགས་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད། གཟུགས་མི་རྟག་ཅེས་བྱ་བ་དང་། གཟུགས་བདེ་ཞེས་བྱ་བ་དང་། གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། གཟུགས་བདག་ཅེས་བྱ་བ་དང་། གཟུགས་བདག་མེད་ཅེས་བྱ་བ་དང་། གཟུགས་ཞི་ཞེས་བྱ་བ་དང་། གཟུགས་མ་ཞི་ཞེས་བྱ་བ་དང་། གཟུགས་སྟོང་ཞེས་བྱ་བ་དང་། གཟུགས་མི་སྟོང་ཞེས་བྱ་བ་དང་། གཟུགས་མཚན་མ་ཡོད་ཅེས་བྱ་བ་དང་། གཟུགས་མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། གཟུགས་སྨོན་པ་ཡོད་ཅེས་བྱ་བ་དང་། གཟུགས་སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། གཟུགས་
en: Venerable Śāradvatīputra,” replied Subhūti, “when bodhisattva great beings practice the perfection of wisdom, and do not engage with physical forms; do not engage with feelings, perceptions, formative predispositions, or consciousness; do not engage with the distinguishing marks of physical forms; do not engage with the distinguishing marks of feelings, perceptions, formative predispositions, or consciousness; do not engage with the notion that physical forms are permanent; do not engage with the notion that physical forms are impermanent, the notion that physical forms are imbued with happiness, the notion that physical forms are imbued with suffering, the notion that physical forms are endowed with self, the notion that physical forms are without self, the notion that physical forms are at peace, the notion that physical forms are not at peace, the notion that physical forms are empty, the notion that physical forms are not empty, the notion that physical forms are with signs, the notion that physical forms are without signs, the notion that physical forms are with aspirations, the notion that physical forms are without aspirations, the notion that physical forms are void, or the notion that physical forms are not void; and do not engage with the notion that feelings, perceptions, formative predispositions, or consciousness are permanent; do not engage with the notion that these are impermanent, the notion that they are imbued with happiness, the notion that they are imbued with suffering, the notion that they are endowed with self, the notion that they are without self, the notion that they are at peace, the notion that they are not at peace, the notion that they are empty, the notion that they are not empty, the notion that they are with signs, the notion that they are without signs, {Dt.141} the notion that they are with aspirations, the notion that they are without aspirations, the notion that they are void, or the notion that they are not void, then at that time one should know that those bodhisattva great beings do possess skill in means. “

source: དབེན་ཞེས་བྱ་བ་དང་། གཟུགས་མི་དབེན་ཞེས་བྱ་བར་མི་སྤྱོད་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད། མི་རྟག་ཅེས་བྱ་བ་དང་། བདེ་ཞེས་བྱ་བ་དང་། སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་ཅེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། མ་ཞི་ཞེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མི་སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་ཡོད་ཅེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་ཡོད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བ་དང་། མི་དབེན་ཞེས་བྱ་བར་མི་སྤྱོད་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པར་ཤེས་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཡང་གཟུགས་མ་ཡིན།
en: If you were to ask why, Venerable Śāradvatīputra, it is because the emptiness of physical forms is not physical forms.

source: སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་གཟུགས་མེད། གཟུགས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: Physical forms are not other than emptiness, nor is emptiness other than physical forms.

source: སྟོང་པ་ཉིད་ཀྱང་གཟུགས། གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: Emptiness is indeed physical forms, and the nature of physical forms is indeed emptiness.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཡང་རྣམ་པར་ཤེས་པ་མ་ཡིན།
en: The emptiness of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and the aforementioned aggregates].

source: སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་རྣམ་པར་ཤེས་པ་མེད། རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: Consciousness [and the other aggregates] are not other than emptiness, nor is emptiness other than consciousness.

source: སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པ། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: Emptiness is indeed consciousness, and the nature of consciousness is indeed emptiness.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: The emptiness of the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas is not the eighteen distinct qualities of the buddhas [and so forth].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཡང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མ་ཡིན། སྟོང་པ་ཉིད་ལས་གུད་ན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མེད། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ། སྟོང་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས།
en: The eighteen distinct qualities of the buddhas [and so forth] are not other than emptiness, nor is emptiness other than the eighteen distinct qualities of the buddhas [and so forth].

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: Emptiness is indeed the eighteen distinct qualities of the buddhas [and so forth], and the eighteen distinct qualities of the buddhas [and so forth] are indeed emptiness.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། ཐབས་མཁས་པར་ཤེས་པར་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅུ་གཅིག་པ།
en: Venerable Śāradvatīputra, one should know that bodhisattva great beings who practice the perfection of wisdom in that manner do possess skill in means. “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བའི་སྐལ་བ་ཡོད་དོ།
en: Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner will have the good fortune to attain manifest buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཀྱང་སྤྱོད་དོ་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: Even when they are practicing the perfection of wisdom, they do not accept that they are practicing it.

source: །མི་སྤྱོད་ཀྱང་མི་སྤྱོད་དོ་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: Even when they are not practicing it, they do not accept that they are not practicing it.

source: །སྤྱོད་པ་འང་མ་ཡིན་མི་སྤྱོད་པ་འང་མ་ཡིན་ཞེས་བྱ་བར་མི་དམིགས་སོ།
en: Even when they are neither practicing nor not practicing it, they do not accept that they are [neither practicing nor] not practicing it.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྤྱོད་ཅེས་བྱ་བར་ཡང་མི་དམིགས་མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་མི་དམིགས།
en: Why, Venerable Subhūti, when bodhisattva great beings practice the perfection of wisdom, do they not accept that they are practicing it even when they are practicing it?

source: སྤྱོད་ཀྱང་སྤྱོད་ལ་མི་སྤྱོད་ཀྱང་མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་མི་དམིགས།
en: Why do they not accept that they are not practicing it even when they are not practicing it?

source: སྤྱོད་པ་ཡང་མ་ཡིན།
en: Why do they not accept that they are both practicing and not practicing it, even when they are both practicing and not practicing it?

source: མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བར་ཡང་མི་དམིགས་པ་ཡིན།
en: Why do they not accept that they are [neither practicing nor] not practicing it, even when they are neither practicing nor not practicing it?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རང་བཞིན་མི་དམིགས་པའི་ཕྱིར་ཏེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “this is because they do not apprehend the intrinsic nature of the perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དངོས་པོ་མེད་པའི་རང་བཞིན་ཏེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན།
en: If you ask why, it is because the perfection of wisdom has the intrinsic nature of nonentity.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྤྱོད་དོ་ཞེས་བྱ་བར་ཡང་མི་དམིགས་སོ། །མི་སྤྱོད་དོ་ཞེས་བྱ་བར་ཡང་མི་དམིགས་སོ། །སྤྱོད་ཀྱང་སྤྱོད་ལ་མི་སྤྱོད་ཀྱང་མི་སྤྱོད་དོ་ཞེས་བྱ་བར་ཡང་མི་དམིགས་སོ། །སྤྱོད་པ་འང་མ་ཡིན།
en: That, Venerable Śāradvatīputra, is the formulation explaining how, when bodhisattva great beings practice the perfection of wisdom, they do not accept that they are practicing it; nor indeed do they accept that they are not practicing it; nor do they accept that they are [both practicing and] not practicing it, even when they are both practicing and not practicing it; nor do they accept that they are [neither practicing nor] not practicing it, even when they are neither practicing nor not practicing it.

source: མི་སྤྱོད་པ་འང་མ་ཡིན་ནོ་ཞེས་བྱ་བར་ཡང་མི་དམིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་རང་བཞིན་དུ་ཁོང་དུ་ཆུད་ཅིང་མ་བླངས་པའི་ཕྱིར་ཏེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། གལ་ཏེ་སེམས་མ་ཞུམ།
en: If one were to ask why, it is because they have understood that all phenomena have the intrinsic nature of nonentity, and have not appropriated them. “

source: ཀུན་ཏུ་མ་ཞུམ། མི་སྐྲག །ཀུན་ཏུ་མི་སྐྲག །ཀུན་ཏུ་སྐྲག་པར་མི་འགྱུར་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་གྱུར་པར་རིག་པར་བྱའོ།
en: When bodhisattva great beings practice the perfection of wisdom in this manner, if they are not disheartened, not intimidated, not afraid, not terrified, and will not be terrified, then, Venerable Śāradvatīputra, one should know that these bodhisattva great beings are approaching all-aspect omniscience. {

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར། གཉིས་སུ་མེད་གཉིས་སུ་བྱར་མེད་དོ།
en: Dt.142} “This all-aspect omniscience indeed is without duality and cannot be divided into two because all phenomena are without intrinsic nature.

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་ཞེས་བྱ་བ་སྟེ།
en: It is the meditative stability of bodhisattva great beings called the nonarising of all phenomena.

source: རྒྱ་ཆེ་བ་མཆོག་ཏུ་བྱ་བ་ཚད་མེད་པར་ངེས་པ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་སྟེ།
en: It is spacious, supreme, and indeterminate, and it cannot be misappropriated by any śrāvakas or pratyekabuddhas.

source: ཏིང་ངེ་འཛིན་དེས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །སྨྲས་པ།
en: Bodhisattva great beings who engage in this meditative stability will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཏིང་ངེ་འཛིན་འདི་འབའ་ཞིག་གིས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའམ། འོན་ཏེ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གཞན་དག་ཀྱང་ཡོད། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Venerable Subhūti, do bodhisattva great beings who engage with this meditative stability alone swiftly attain consummate buddhahood in unsurpassed, complete enlightenment, or are there also other meditative stabilities similar to it?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཏིང་ངེ་འཛིན་གཞན་དག་ལ་རྣམ་པར་སྤྱོད་པས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ཡོད་དོ། །སྨྲས་པ།
en: Venerable Śāradvatīputra,” replied Subhūti, “there are indeed other meditative stabilities, engaging with which bodhisattva great beings swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཏིང་ངེ་འཛིན་གཞན་གང་དག་གིས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡིན་རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Venerable Subhūti, engaging with which other meditative stabilities will bodhisattva great beings swiftly attain consummate buddhahood in unsurpassed, complete enlightenment?”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Subhūti replied, “Venerable Śāradvatīputra, (1) there is the meditative stability of bodhisattva great beings named heroic valor.

source: ཏིང་ངེ་འཛིན་དེས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Engaging with this meditative stability, bodhisattva great beings will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་བཞིན་དུ་རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: Similarly, (2) there is the meditative stability named precious seal. (

source: །སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 3) There is the meditative stability named lion’s play. (

source: །ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 4) There is the meditative stability named beautiful moon. (

source: །ཟླ་བའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 5) There is the meditative stability named crest of the moon’s victory banner. (

source: །ཆོས་ཐམས་ཅད་ལས་ཤིན་དུ་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 6) There is the meditative stability named surpassing all phenomena. (

source: །ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 7) There is the meditative stability named seal of all phenomena. (

source: །སྤྱི་གཙུག་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 8) There is the meditative stability named surveying the crown pinnacle. (

source: །ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 9) There is the meditative stability named certainty in the realm of phenomena. (

source: །ངེས་པའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 10) There is the meditative stability named crest of certainty’s victory banner. (

source: །རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 11) There is the meditative stability named vajra. (

source: །ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 12) There is the meditative stability named seal of entry into all phenomena. (

source: །ཏིང་ངེ་འཛིན་ལ་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 13) There is the meditative stability named consecrated as a king of meditative stabilities. (

source: །འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 14) There is the meditative stability named diffusion of light rays. (

source: །དཔུང་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 15) There is the meditative stability named array of power. (

source: །ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 16) There is the meditative stability named sublimation [of all phenomena]. (

source: །ངེས་པའི་ཚིག་ལ་གདོན་མི་ཟ་བར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 17) There is the meditative stability named engaging with certainty in lexical explanations. (

source: །ཚིག་བླ་དགས་ལ་ཡང་དག་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 18) There is the meditative stability named entry into designations. (

source: །ཕྱོགས་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 19) There is the meditative stability named observation of spatial directions. (

source: །ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 20) There is the meditative stability named receiving the seal. (

source: །ཉམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 21) There is the meditative stability named unimpaired. (

source: །ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 22) There is the meditative stability named oceanic seal gathering all phenomena. (

source: །ནམ་མཁའ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 23) There is the meditative stability named permeation of space. (

source: །རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 24) There is the meditative stability named vajra maṇḍala. (

source: །རྒྱལ་མཚན་རྩེ་མོའི་དཔུང་རྒྱན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 25) There is the meditative stability named shoulder ornament of the victory banner’s crest. (

source: །དབང་པོའི་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 26) There is the meditative stability named crest of power. (

source: །རྒྱུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 27) There is the meditative stability named pursuit of the stream. (

source: །སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 28) There is the meditative stability named yawning lion. (

source: །སྣྲེལ་ཞི་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 29) There is the meditative stability named out of order. (

source: །ཉོན་མོངས་པ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 30) There is the meditative stability named repudiation of mental afflictions. (

source: །རྣམ་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 31) There is the meditative stability named illumination. (

source: །ཚོལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 32) There is the meditative stability named unseeking. (

source: །གནས་ལ་རྟེན་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 33) There is the meditative stability named no fixed abode. (

source: །སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 34) There is the meditative stability named free from mentation. (

source: །དྲི་མ་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 35) There is the meditative stability named taintless lamp. (

source: །འོད་མཐའ་ཡས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 36) There is the meditative stability named boundless light. (

source: །འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 37) There is the meditative stability named illuminator. (

source: །ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 38) There is the meditative stability named total illumination. (

source: །དག་པ་དམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 39) There is the meditative stability named pure sanctuary. (

source: །འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 40) There is the meditative stability named immaculate light. {

source: །དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: Dt.143} (41) There is the meditative stability named bringer of joy. (

source: །གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 42) There is the meditative stability named lightning lamp. (

source: །ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 43) There is the meditative stability named inexhaustible. (

source: །མི་ཕམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 44) There is the meditative stability named unvanquished. (

source: །གཟི་བརྗིད་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 45) There is the meditative stability named majestic. (

source: །ཟད་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 46) There is the meditative stability named free from extinction. (

source: །མི་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 47) There is the meditative stability named unmoving. (

source: །འཇིགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 48) There is the meditative stability named without fear. (

source: །ཉི་མའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 49) There is the meditative stability named lamp of the sun. (

source: །ཟླ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 50) There is the meditative stability named immaculate moon. (

source: །ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 51) There is the meditative stability named lamp of wisdom. (

source: །སྣང་བ་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 52) There is the meditative stability named pure appearance. (

source: །སྣང་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 53) There is the meditative stability named illuminating. (

source: །བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 54) There is the meditative stability named engaging in performance. (

source: །ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 55) There is the meditative stability named crest of wisdom. (

source: །རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 56) There is the meditative stability named vajra-like. (

source: །སེམས་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 57) There is the meditative stability named stability of mind. (

source: །རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 59) There is the meditative stability named consecrated. (

source: །རིན་ཆེན་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 60) There is the meditative stability named jewel cusp. (

source: །ཆོས་དམ་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 61) There is the meditative stability named seal of the Dharma. (

source: །ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 62) There is the meditative stability named sameness of all phenomena. (

source: །དགའ་བ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 63) There is the meditative stability named renunciation of delight. (

source: །ཆོས་ཀྱི་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 64) There is the meditative stability named sublimation of phenomena. (

source: །རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 65) There is the meditative stability named dispersal. (

source: །ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 66) There is the meditative stability named distinguishing the terms associated with all phenomena. (

source: །ཡི་གེ་མཉམ་པར་འགོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 67) There is the meditative stability named establishing the sameness of letters. (

source: །ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 68) There is the meditative stability named devoid of letters. (

source: །དམིགས་པ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 69) There is the meditative stability named eradication of referents. (

source: །འགྱུར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 70) There is the meditative stability named unmodified. (

source: །རྣམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 71) There is the meditative stability named no aspect. (

source: །མིང་ངེས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 72) There is the meditative stability named ascertainment of names. (

source: །གནས་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 73) There is the meditative stability named roaming. (

source: །རབ་རིབ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 74) There is the meditative stability named devoid of darkness. (

source: །སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 75) There is the meditative stability named engaging in conduct. (

source: །གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 76) There is the meditative stability named unwavering. (

source: །ཡུལ་ལས་རྒལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 77) There is the meditative stability named transcendence of the range. (
